Add Docs
Signed-off-by: James Spadafora <spadjv@gmail.com>
